from datetime import datetime
import matplotlib.pyplot as plt
import json


# Ваш JSON-объект
json_data = """
{
    "data": {
        "1": {
            "oddsHistory": [
                [
                    1713905763000,
                    1.55
                ],
                [
                    1713906636000,
                    1.62
                ],
                [
                    1713907062000,
                    1.65
                ],
                [
                    1713907504000,
                    1.67
                ],
                [
                    1713908356000,
                    1.73
                ],
                [
                    1713909214000,
                    1.83
                ],
                [
                    1713909615000,
                    1.95
                ],
                [
                    1713910445000,
                    1.84
                ],
                [
                    1713911309000,
                    1.91
                ],
                [
                    1713911707000,
                    2.13
                ],
                [
                    1713912543000,
                    2.26
                ],
                [
                    1713912972000,
                    2.35
                ],
                [
                    1713941792000,
                    2.27
                ],
                [
                    1713945061000,
                    2.51
                ],
                [
                    1714067502000,
                    2.54
                ]
            ],
            "limitOdds": [
                1.55,
                2.54
            ]
        },
        "2": {
            "oddsHistory": [
                [
                    1713905763000,
                    6.46
                ],
                [
                    1713906636000,
                    5.85
                ],
                [
                    1713907062000,
                    5.65
                ],
                [
                    1713907504000,
                    5.46
                ],
                [
                    1713908356000,
                    5.1
                ],
                [
                    1713909214000,
                    4.58
                ],
                [
                    1713909615000,
                    4.165
                ],
                [
                    1713910445000,
                    4.485
                ],
                [
                    1713911309000,
                    4.2
                ],
                [
                    1713911707000,
                    3.605
                ],
                [
                    1713912543000,
                    3.345
                ],
                [
                    1713912972000,
                    3.19
                ],
                [
                    1713941792000,
                    3.325
                ],
                [
                    1713945061000,
                    2.956
                ],
                [
                    1714067502000,
                    2.89
                ]
            ],
            "limitOdds": [
                2.89,
                6.46
            ]
        },
        "3": {
            "oddsHistory": [
                [
                    1713905763000,
                    3.96
                ],
                [
                    1713906636000,
                    3.8
                ],
                [
                    1713907062000,
                    3.72
                ],
                [
                    1713907504000,
                    3.7
                ],
                [
                    1713908356000,
                    3.6
                ],
                [
                    1713909214000,
                    3.48
                ],
                [
                    1713909615000,
                    3.36
                ],
                [
                    1713910445000,
                    3.5
                ],
                [
                    1713911309000,
                    3.44
                ],
                [
                    1713911707000,
                    3.28
                ],
                [
                    1713912543000,
                    3.24
                ],
                [
                    1713912972000,
                    3.2
                ],
                [
                    1713941792000,
                    3.24
                ],
                [
                    1713945061000,
                    3.18
                ]
            ],
            "limitOdds": [
                3.18,
                3.96
            ]
        }
    },
    "extraData": {
        "countryCode": "RU"
    }
}"""
parsed_data = json.loads(json_data)

odds_history = parsed_data['data']['2']['oddsHistory']
timestamps = [str(entry[0])[:-3] for entry in odds_history]  # Обрезаем последние три символа
datetime_obj = [datetime.fromtimestamp(int(timestamp)) for timestamp in timestamps]
formatted_datetimes = [dt.strftime('%Y-%m-%d %H:%M:%S') for dt in datetime_obj]
odds = [entry[1] for entry in odds_history]

# Построим график
plt.figure(figsize=(10, 6))
plt.plot(formatted_datetimes, odds, label='Событие', marker='o', linestyle='-')
plt.xticks(formatted_datetimes[::4])
# Добавим подписи к осям и легенду
plt.xlabel('Дата')
plt.ylabel('Коэффициент')
plt.legend()

# Отобразим график
plt.show()
